<?php

namespace App\Nova;

use Closure;
use Illuminate\Http\Request;
use Laravel\Nova\Fields\ID;
use Laravel\Nova\Fields\Slug;
use Laravel\Nova\Fields\Text;
use Laravel\Nova\Fields\Select;
use Laravel\Nova\Http\Requests\NovaRequest;

class City extends Resource
{
    /**
     * The model the resource corresponds to.
     *
     * @var class-string<\App\Models\City>
     */
    public static $model = \App\Models\City::class;

    /**
     * The single value that should be used to represent the resource when being displayed.
     *
     * @var string
     */
    public static $title = 'name';

    /**
     * The columns that should be searched.
     *
     * @var array
     */
    public static $search = [
        'name',
    ];

    public static function label()
    {
        return 'Города';
    }

    /**
     * Get the fields displayed by the resource.
     *
     * @param  \Laravel\Nova\Http\Requests\NovaRequest  $request
     * @return array
     */
    public function fields(NovaRequest $request)
    {
        $regionOptions = $this->getRegionOptions($request->input('district')); // вызов функции, которая подтягивает регионы в зависимости от округа
        return [
            ID::make()->sortable(),
            Text::make('Название', 'name'),
            Select::make('Округ', 'district')->options([
                'Дальневосточный' => 'Дальневосточный',
                'Приволжский' => 'Приволжский',
                'Северо-Западный' => 'Северо-Западный',
                'Северо-Кавказский' => 'Северо-Кавказский',
                'Сибирский' => 'Сибирский',
                'Уральский' => 'Уральский',
                'Центральный' => 'Центральный',
                'Южный' => 'Южный',
            ]),
            Select::make('Регион', 'region')
            ->options($regionOptions)
            ->dependsOn('district', $regionOptions),
            Slug::make('Slug', 'slug')->from('name'),
        ];
    }

    public function getRegionOptions($selectedDistrict)
    {
        switch ($selectedDistrict) {
            case 'Дальневосточный':
                return [
                    'Бурятия республика' => 'Бурятия республика',
                    'Саха /Якутия/ республика' => 'Саха /Якутия/ республика',
                    'Забайкальский край' => 'Забайкальский край',
                    'Камчатский край' => 'Камчатский край',
                    'Приморский край' => 'Приморский край',
                    'Хабаровский край' => 'Хабаровский край',
                    'Амурская область' => 'Амурская область',
                    'Магаданская область' => 'Магаданская область',
                    'Сахалинская область' => 'Сахалинская область',
                    'Еврейская автономная область' => 'Еврейская автономная область',
                    'Чукотский автономный округ' => 'Чукотский автономный округ',
                ];
            case 'Приволжский':
                return [
                    'Башкортостан республика' => 'Башкортостан республика',
                    'Марий Эл республика' => 'Марий Эл республика',
                    'Мордовия республика' => 'Мордовия республика',
                    'Татарстан республика' => 'Татарстан республика',
                    'Удмуртская республика' => 'Удмуртская республика',
                    'Чувашская республика Чувашия' => 'Чувашская республика Чувашия',
                    'Пермский край' => 'Пермский край',
                    'Кировская область' => 'Кировская область',
                    'Нижегородская область' => 'Нижегородская область',
                    'Оренбургская область' => 'Оренбургская область',
                    'Пензенская область' => 'Пензенская область',
                    'Самарская область' => 'Самарская область',
                    'Саратовская область' => 'Саратовская область',
                    'Ульяновская область' => 'Ульяновская область',
                ];
            case 'Северо-Западный':
                return [
                    'Карелия республика' => 'Карелия республика',
                    'Коми республика' => 'Коми республика',
                    'Архангельская область' => 'Архангельская область',
                    'Вологодская область' => 'Вологодская область',
                    'Калининградская область' => 'Калининградская область',
                    'Санкт-Петербург город' => 'Санкт-Петербург город',
                    'Ленинградская область' => 'Ленинградская область',
                    'Мурманская область' => 'Мурманская область',
                    'Новгородская область' => 'Новгородская область',
                    'Псковская область' => 'Псковская область',
                    'Ненецкий автономный округ' => 'Ненецкий автономный округ',
                ];
            case 'Северо-Кавказский':
                return [
                    'Дагестан республика' => 'Дагестан республика',
                    'Ингушетия республика' => 'Ингушетия республика',
                    'Кабардино-Балкарская республика' => 'Кабардино-Балкарская республика',
                    'Карачаево-Черкесская республика' => 'Карачаево-Черкесская республика',
                    'Северная Осетия - Алания республика' => 'Северная Осетия - Алания республика',
                    'Чеченская республика' => 'Чеченская республика',
                    'Ставропольский край' => 'Ставропольский край',
                ];
            case 'Сибирский':
                return [
                    'Алтай республика' => 'Алтай республика',
                    'Тыва республика' => 'Тыва республика',
                    'Хакасия республика' => 'Хакасия республика',
                    'Алтайский край' => 'Алтайский край',
                    'Красноярский край' => 'Красноярский край',
                    'Иркутская область' => 'Иркутская область',
                    'Кемеровская область - Кузбасс область' => 'Кемеровская область - Кузбасс область',
                    'Новосибирская область' => 'Новосибирская область',
                    'Омская область' => 'Омская область',
                    'Томская область' => 'Томская область',
                ];
            case 'Уральский':
                return [
                    'Курганская область' => 'Курганская область',
                    'Свердловская область' => 'Свердловская область',
                    'Тюменская область' => 'Тюменская область',
                    'Челябинская область' => 'Челябинская область',
                    'Ханты-Мансийский Автономный округ - Югра автономный округ' => 'Ханты-Мансийский Автономный округ - Югра автономный округ',
                    'Ямало-Ненецкий автономный округ' => 'Ямало-Ненецкий автономный округ',
                ];
            case 'Центральный':
                return [
                    'Белгородская область' => 'Белгородская область',
                    'Брянская область' => 'Брянская область',
                    'Владимирская область' => 'Владимирская область',
                    'Воронежская область' => 'Воронежская область',
                    'Ивановская область' => 'Ивановская область',
                    'Калужская область' => 'Калужская область',
                    'Костромская область' => 'Костромская область',
                    'Курская область' => 'Курская область',
                    'Липецкая область' => 'Липецкая область',
                    'Москва город' => 'Москва город',
                    'Московская область' => 'Московская область',
                    'Орловская область' => 'Орловская область',
                    'Рязанская область' => 'Рязанская область',
                    'Смоленская область' => 'Смоленская область',
                    'Тамбовская область' => 'Тамбовская область',
                    'Тверская область' => 'Тверская область',
                    'Тульская область' => 'Тульская область',
                    'Ярославская область' => 'Ярославская область',
                ];
            case 'Южный':
                return [
                    'Адыгея республика' => 'Адыгея республика',
                    'Калмыкия республика' => 'Калмыкия республика',
                    'Краснодарский край' => 'Краснодарский край',
                    'Астраханская область' => 'Астраханская область',
                    'Волгоградская область' => 'Волгоградская область',
                    'Ростовская область' => 'Ростовская область',
                ];            
        }
    }

    /**
     * Get the cards available for the request.
     *
     * @param  \Laravel\Nova\Http\Requests\NovaRequest  $request
     * @return array
     */
    public function cards(NovaRequest $request)
    {
        return [];
    }

    /**
     * Get the filters available for the resource.
     *
     * @param  \Laravel\Nova\Http\Requests\NovaRequest  $request
     * @return array
     */
    public function filters(NovaRequest $request)
    {
        return [];
    }

    /**
     * Get the lenses available for the resource.
     *
     * @param  \Laravel\Nova\Http\Requests\NovaRequest  $request
     * @return array
     */
    public function lenses(NovaRequest $request)
    {
        return [];
    }

    /**
     * Get the actions available for the resource.
     *
     * @param  \Laravel\Nova\Http\Requests\NovaRequest  $request
     * @return array
     */
    public function actions(NovaRequest $request)
    {
        return [];
    }
}
